--[[
    俄罗斯方块配置表
]]

-- 横条
Block_1_0 = {
    {0, 0, 0, 0}, 
    {1, 1, 1, 1}, 
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}}

-- 竖条    
Block_1_1 = {
    {0, 0, 1, 0}, 
    {0, 0, 1, 0}, 
    {0, 0, 1, 0}, 
    {0, 0, 1, 0}}

-- T型
Block_T_0 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {1, 1, 1, 0}, 
    {0, 1, 0, 0}}
Block_T_1 = {
    {0, 0, 0, 0}, 
    {0, 1, 0, 0}, 
    {1, 1, 0, 0}, 
    {0, 1, 0, 0}}
Block_T_2 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {0, 1, 0, 0}, 
    {1, 1, 1, 0}}
Block_T_3 = {
    {0, 0, 0, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 1, 0}, 
    {0, 1, 0, 0}}

-- L型
Block_L_0 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {1, 1, 1, 0}, 
    {1, 0, 0, 0}}
Block_L_1 = {
    {0, 0, 0, 0}, 
    {1, 1, 0, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 0, 0}}
Block_L_2 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {0, 0, 1, 0}, 
    {1, 1, 1, 0}}
Block_L_3 = {
    {0, 0, 0, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 1, 0}}

-- 反L型
Block_RL_0 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {1, 1, 1, 0}, 
    {0, 0, 1, 0}}
Block_RL_1 = {
    {0, 0, 0, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 0, 0}, 
    {1, 1, 0, 0}}
Block_RL_2 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {1, 0, 0, 0}, 
    {1, 1, 1, 0}}
Block_RL_3 = {
    {0, 0, 0, 0}, 
    {0, 1, 1, 0}, 
    {0, 1, 0, 0}, 
    {0, 1, 0, 0}}

-- Z型
Block_Z_0 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {1, 1, 0, 0}, 
    {0, 1, 1, 0}}
Block_Z_1 = {
    {0, 0, 0, 0}, 
    {0, 0, 1, 0}, 
    {0, 1, 1, 0}, 
    {0, 1, 0, 0}}

-- 反Z型
Block_RZ_0 = {
    {0, 0, 0, 0}, 
    {0, 0, 0, 0}, 
    {0, 1, 1, 0}, 
    {1, 1, 0, 0}}
Block_RZ_1 = {
    {0, 0, 0, 0}, 
    {1, 0, 0, 0}, 
    {1, 1, 0, 0}, 
    {0, 1, 0, 0}}

-- 方块型
Block_Plus_0 = {
    {0, 0, 0, 0}, 
    {0, 1, 1, 0}, 
    {0, 1, 1, 0}, 
    {0, 0, 0, 0}}

-- 方块形状表
BlockList = {
    [1] = {Block_1_0, Block_1_1}, 
    [2] = {Block_T_0, Block_T_1, Block_T_2, Block_T_3}, 
    [3] = {Block_L_0, Block_L_1, Block_L_2, Block_L_3}, 
    [4] = {Block_RL_0, Block_RL_1, Block_RL_2, Block_RL_3},
    [5] = {Block_Z_0, Block_Z_1}, 
    [6] = {Block_RZ_0, Block_RZ_1}, 
    [7] = {Block_Plus_0}
}

-- 主面板宽度
BoardWidth = 10
-- 主面板高度
BoardHeight = 20

-- 当前俄罗斯方块数据
currentBlock = {
    ['mainIndex'] = 1,      -- 在方块表中的形状位置
    ['subIndex'] = 1,       -- 在形状表中的位置
    ['curRow'] = 1,         -- 在主面板所在的当前行
    ['curColumn'] = 1,      -- 在主面板所在的当前列
    ['block']={}            -- 具体俄罗斯方块
}           

-- 下一个俄罗斯方块数据
nextBlock = {
    ['mainIndex'] = 1,      -- 在方块表中的形状位置
    ['subIndex'] = 1        -- 在形状表中的位置
}

-- 主面板数据
board = {}


-- 分数配置表 消除行数对应所获得的分数
ScoreList = {
    [1] = 10,
    [2] = 30,
    [3] = 60,
    [4] = 100,
}

